package org.example.trainlogic.MainPackages;

import java.util.LinkedList;

public class ViewInfo {
    public static void info_platform(Train train){
        View.view("%-37s| %-33s| %-26s |%40s%n",
                "Номер платформы", "Вместимость (кг/шт)", "Масса (кг/шт)", "Груз");
        View.view("=========================================================================================================================%n");
        for(Platform platform: train.getPlatforms()){
            platform.DisplayInfo();
        }
        View.view("=========================================================================================================================%n");
    }

    public static void info_trains(LinkedList<Train> train){
        View.view("%-37s| %-37s%n", "Номер поезда", "количество платформ");
        View.view("===========================================================================%n");
        for (Train t: train){
            View.view("%-37s| %-37s%n", t.getNum_Train(), t.getPlatforms().size());
        }
        View.view("===========================================================================%n");
    }

    public static void info_strg(Storages storages){
        View.view("%-37s| %-33s| %-26s |%40s%n",
                "Номер склада",  "Вместимость (кг/шт)", "Масса (кг/шт)", "Груз");
        View.view("=========================================================================================================================%n");
        for (Storage storage: storages.getStorages()){
            storage.DisplayInfo();
        }
        View.view("=========================================================================================================================%n");

    }


    public static void view_type_platforms() {
        View.view("для нефть, дизельное топливо, мазут. . . . . . . . . . . 1\n");
        View.view("для зерно, уголь, песок, . . . . . . . . . . . . . . . . 2\n");
        View.view("для контейнеров. . . . . . . . . . . . . . . . . . . . . 3\n");
        View.view("для автомобилей. . . . . . . . . . . . . . . . . . . . . 4\n");
        View.view("Выход в меню . . . . . . . . . . . . . . . . . . . . . . 5\n\n");
    }

    public static void view_type_cargos() {
        View.view("Нефть. . . . . . . . . . . . . . . . . . . . . . . . . . 1\n\n");
        View.view("Дизельное топливо. . . . . . . . . . . . . . . . . . . . 2\n\n");
        View.view("Мазут. . . . . . . . . . . . . . . . . . . . . . . . . . 3\n\n");
        View.view("Зерно. . . . . . . . . . . . . . . . . . . . . . . . . . 4\n\n");
        View.view("Уголь. . . . . . . . . . . . . . . . . . . . . . . . . . 5\n\n");
        View.view("Песок. . . . . . . . . . . . . . . . . . . . . . . . . . 6\n\n");
        View.view("Контейнер. . . . . . . . . . . . . . . . . . . . . . . . 7\n\n");
        View.view("Автомобиль . . . . . . . . . . . . . . . . . . . . . . . 8\n\n");
        View.view("Отменить . . . . . . . . . . . . . . . . . . . . . . . . 9\n\n");
    }

}
